app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE (is_deleted = false)
---
  def index
    @categories = Category.where("is_deleted = false")

INSERT INTO "categories" ("name", "is_deleted", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dededed"], ["is_deleted", 0], ["created_at", "2023-10-02 18:02:51.794433"], ["updated_at", "2023-10-02 18:02:51.794433"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "is_deleted" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["is_deleted", 0], ["updated_at", "2023-10-02 18:01:37.164488"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

UPDATE "categories" SET "is_deleted" = ? WHERE "categories"."id" = ?  [["is_deleted", 1], ["id", 5]]
---
  def destroy
    @category.update_columns(is_deleted: true)

SELECT "categories".* FROM "categories" WHERE (is_deleted = false)
---
  def all_data
    @categories = Category.all