app/controllers/home_controller.rb

  def index
  	@products = Product.where("is_deleted = false")
---
SELECT "products".* FROM "products" WHERE (is_deleted = false)