app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (is_deleted = false)
---
  def index
    @products = Product.where("is_deleted = false")

SELECT "categories".* FROM "categories"
SELECT "suppliers".* FROM "suppliers"
---
  def edit
    @categories = Category.all
    @suppliers = Supplier.all

INSERT INTO "products" ("name", "qty", "category_id", "is_deleted", "created_at", "updated_at", "price", "supplier_id", "code", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "is_deleted" = ?, "updated_at" = ?, "image" = ? WHERE "products"."id" = ?  [["is_deleted", 0], ["updated_at", "2023-10-02 16:32:06.945507"], ["image", "https://specificationsplus.com/wp-content/uploads/2022/11/Samsung-Galaxy-Tab-S10-FE-Specifications-Plus.jpg"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

UPDATE "products" SET "is_deleted" = ? WHERE "products"."id" = ?  [["is_deleted", 1], ["id", 13]]
---
  def destroy
    @product.update_columns(is_deleted: true)