app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers" WHERE (is_deleted = false)
---
  def index
    @suppliers = Supplier.all

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_supplier
      @supplier = Supplier.find(params[:id])